Autodesk.Revit.DB.ExportUtils.GetNurbsSurfaceDataForSurface(Autodesk.Revit.DB.Surface)
Returns the necessary information to define a NURBS surface
for a given Autodesk::Revit::DB::HermiteSuface or Autodesk::Revit::DB::RuledSuface.
Remarks:
This function is intended for export purposes.
surface:
The HermiteSurface or RuledSurface to be converted.
Returns:
A class containing the necessary data to define a NURBS surface.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This surface type is not supported for this function.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Couldn't get NURBS data from surface.
Since:
2021

Autodesk.Revit.DB.ExportUtils.GetGBXMLDocumentId(Autodesk.Revit.DB.Document)
Retrieves the GUID representing this document in exported gbXML files.
Remarks:
This id can be used to cross-reference different gbXML exports from the same document.
document:
The document.
Returns:
The value of the GUID representing this document in gbXML export.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportUtils.GetExportId(Autodesk.Revit.DB.Subelement)
Retrieves the GUID representing the subelement in DWF and IFC export.
Remarks:
This id is used in the contents of DWF export and IFC export and it should be used
only when cross-referencing to the contents of these export formats.
When storing Ids that will need to be mapped back to subelements in future sessions,
Autodesk.Revit.DB.Subelement.UniqueId must be used.
subelement:
The subelement.
Returns:
The value of the GUID representing the subelement in the export context.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.ExportUtils.GetExportId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Retrieves the GUID representing this element in DWF and IFC export.
Remarks:
This id is used in the contents of DWF export and IFC export and it should be used
only when cross-referencing to the contents of these export formats.
When storing Ids that will need to be mapped back to elements in future sessions,
Autodesk.Revit.DB.Element.UniqueId must be used.
document:
The document.
elementId:
The id of the element.
Returns:
The value of the GUID representing the element in the export context.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011